tutorials/incompressible/pimpleDyMFoam/movingCone/0/pointMotionUx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointScalarField;
    object      pointMotionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           uniform 1;
    }
    farFieldMoving
    {
        type            slip;
    }
    fixedWall
    {
        type            fixedValue;
        value           uniform 0;
    }
    axis
    {
        type            symmetryPlane;
    }
    left
    {
        type            fixedValue;
        value           uniform 0;
    }
    farField
    {
        type            slip;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}

// ************************************************************************* //
